if(typeof(langData) == 'undefined'){
    langData= {};
}


langData["hindi"] = {
        "aksharaValidator" : new RegExp("((?:क|ग|ख|घ|छ|च|झ|ज|ट|ञ|ड|ठ|ण|ढ|थ|त|ध|द|न|फ|प|भ|ब|य|म|र|ळ|ल|व|ष|श|ह|स)(?:़)?(?:(?:्)(?:(?:‍)|(?:‌))?(?:क|ग|ख|घ|छ|च|झ|ज|ट|ञ|ड|ठ|ण|ढ|थ|त|ध|द|न|फ|प|भ|ब|य|म|र|ळ|ल|व|ष|श|ह|स)(?:़)?)*(?:(?:्)|(?:(?:ि|ा|ु|ी|ृ|ू|ॅ|े|ॉ|ै|ो|ौ)?(?:(?:ं)|(?:ः)|(?:ँ))?))?|(?:(?:अ|इ|आ|उ|ई|ऋ|ऊ|ए|ऐ|ओ|औ)(?:(?:ं)|(?:ः)|(?:ँ))?)|(?:१|०|३|२|५|४|७|६|९|८)(?![0-9])|[0-9](?!(?:१|०|३|२|५|४|७|६|९|८)))"),

        'consonants' : new RegExp('क|ग|ख|घ|छ|च|झ|ज|ट|ञ|ड|ठ|ण|ढ|थ|त|ध|द|न|फ|प|भ|ब|य|म|र|ळ|ल|व|ष|श|ह|स'),

        'aksharaFrequency' : {"आ": 84204, "ढ़ों": 10, "स्ज़ि": 3, "झं": 675, "र्टें": 57, "जों": 381, "णों": 595, "झि": 78, "झा": 3030, "ब्ज़े": 134, "ख़्मों": 20, "ब्ज़ी": 17, "ब्ज़ा": 260, "ब्ज़ि": 31, "स्बे": 54, "झे": 3554, "झु": 323, "झी": 200, "झू": 531, "झौ": 1628, "झो": 123, "भ्या": 135, "म़ौ": 1, "खी": 1772, "खु": 2324, "खू": 253, "सिं": 6374, "खे": 20384, "खै": 5, "खो": 2382, "खौ": 16, "ब्बों": 25, "ल्गु": 6, "र्लो": 20, "ब्बी": 133, "र्ति": 603, "र्ता": 1233, "ब्बे": 117, "र्ली": 20, "न्धों": 1, "त्ले": 6, "व्यों": 9, "खं": 1265, "द्व": 14, "क्सॉ": 8, "र्लि": 100, "द्र": 4806, "र्ते": 9, "क्ज़ि": 16, "र्ती": 315, "ब्बा": 904, "ढ्ढे": 4, "श्बू": 56, "श्बु": 3, "हॉं": 30, "ल्कों": 8, "द्घि": 1, "ख़": 14548, "खा": 9806, "खि": 5403, "थाः": 10, "जे": 3580, "चिं": 1546, "जू": 5483, "जी": 13962, "जु": 10999, "जौ": 37, "र्टे": 25, "र्टी": 6879, "जो": 11665, "जै": 4797, "जॉ": 1930, "चीं": 74, "र": 557342, "न्डो": 62, "र्च्यू": 9, "ल्यू": 2, "क्लिं": 100, "ल्या": 222, "न्डि": 2, "क्विं": 7, "म्ब्रि": 12, "जं": 627, "जँ": 2, "त्वों": 62, "र्टि": 834, "द्घ": 8, "स्रा": 117, "जा": 61856, "जि": 15337, "ज़": 24797, "ओ": 8261, "रीः": 44, "रीं": 47, "ट्ज़": 114, "र्ट्रे": 16, "ष्ट्री": 1773, "न्यु": 4, "न्यू": 1469, "न्यौ": 87, "छ": 25938, "ऊँ": 1018, "ऊं": 564, "न्यो": 37, "ज्यॉ": 21, "ज्यो": 72, "र्चें": 1, "ज्यु": 62, "ज्यू": 34, "र्कि": 18, "श्रु": 7, "श्री": 3778, "श्रे": 973, "श्रो": 458, "द्यो": 319, "पीं": 28, "द्यौ": 2, "ट्ठा": 247, "ट्ठि": 18, "द्या": 758, "श्रा": 141, "ज्या": 188, "क़्सा": 18, "न्या": 1811, "ल्डि": 102, "ष्ट्रा": 35, "द्मा": 26, "स्ट्रा": 15, "र्दों": 62, "फें": 190, "वॉ": 663, "वै": 3461, "वो": 5928, "वे": 19896, "वु": 1442, "वी": 5714, "वृ": 587, "यें": 167, "ल्लै": 10, "ल्लो": 1, "न्मा": 6, "ल्ले": 1444, "ल्लु": 24, "ल्ली": 3041, "ल्लू": 18, "द्धों": 14, "च्छी": 1016, "ल": 176761, "च्छे": 513, "ख़्ति": 18, "ख़्ती": 49, "च्छा": 1754, "च्छि": 12, "न्मे": 70, "ल्लि": 79, "ल्ला": 629, "न्मी": 14, "वः": 13, "वं": 3016, "धां": 30, "वि": 50644, "वा": 83141, "म्भा": 13, "ल्लं": 307, "फ़ों": 22, "स्ट्री": 282, "स्ट्रे": 129, "स्ट्रो": 13, "ओं": 7040, "स्ट्रॉ": 227, "क्नि": 2, "क़्की": 2, "म्ला": 2, "र्थों": 32, "ध्वी": 12, "र्णी": 25, "झ": 4266, "श्यू": 23, "श्यो": 9, "बाँ": 451, "बां": 771, "ज्ज़": 12, "ज्जि": 9, "ज्जा": 16, "ज्जु": 13, "ज्जी": 22, "ज्जू": 23, "ज्जे": 6, "ज्जै": 2, "ध्वं": 67, "द्घा": 17, "स्पॉं": 4, "श्या": 440, "र्णा": 109, "र्णि": 46, "ढूं": 128, "ढूँ": 207, "क़्क़": 42, "क्नो": 24, "क्नॉ": 46, "क्नी": 4, "ज़्ज़्त": 3, "ब्लि": 123, "ब्ला": 84, "क्षि": 8096, "क्षा": 7457, "ज": 82460, "ज़्या": 4587, "क़ा": 7056, "क़ि": 442, "ब्लं": 25, "क़ो": 25, "क़ै": 2070, "क़ॉ": 1, "क़ौ": 30, "क़ू": 25, "क़ी": 2437, "क़ु": 136, "क़े": 1876, "ज़्यू": 9, "क्षे": 2735, "क्षु": 11, "क्षी": 707, "ज्ज्व": 11, "चुं": 37, "ख़्सि": 22, "स्त्र": 221, "ब्लॉ": 79, "ब्लै": 400, "ब्ले": 1073, "ब्लू": 140, "क्वां": 7, "इ": 107671, "ल्मा": 32, "र्फ़": 2304, "ट्यू": 153, "ण्डी": 6, "रुँ": 28, "रुं": 48, "फ़्फ़": 678, "ष्प्र": 12, "ठ्ने": 1, "ब्बू": 15, "ण्डा": 15, "ल्मो": 39, "क्ग्रा": 7, "ल्मी": 360, "पुं": 23, "ल्मे": 8, "पुँ": 17, "र्निं": 3, "चौं": 112, "थीं": 1860, "न्मों": 15, "स्क्वे": 37, "ब्रों": 30, "स्प्रे": 18, "फ्यू": 10, "तों": 2707, "श्ली": 283, "श्ले": 195, "श्यों": 45, "पां": 755, "पाँ": 2715, "न्नों": 62, "र्स्ट": 11, "वृं": 11, "टिं": 1821, "ण्य": 21, "च्चि": 136, "च्चा": 546, "उ": 80111, "ण्ड": 18, "आँ": 1862, "आं": 777, "ल्वा": 5, "ल्वि": 17, "स्त्री": 285, "ब्स": 69, "र्ग़ी": 10, "ब्र": 312, "ब्ल": 43, "स्पि": 282, "स्पा": 40, "ब्द": 1618, "ब्ध": 553, "स्पो": 35, "स्पॉ": 1, "स्पै": 35, "र्सा": 5, "स्पू": 7, "स्पी": 412, "स्पे": 517, "झौं": 1, "ल्वी": 4, "न्ख़्वा": 1, "ल्वे": 7, "बिं": 131, "च्चो": 3, "जें": 11221, "च्चे": 1220, "च्ची": 303, "र्टों": 129, "ई": 68472, "मं": 18895, "मः": 18, "टें": 1003, "वीं": 349, "ज़्मो": 30, "र्खि": 60, "म्पे": 6, "हैं": 23, "हैः": 40, "र्किं": 11, "क्स्ड": 13, "म़": 5, "म्प्ला": 8, "मा": 93086, "मि": 39323, "मै": 4442, "मॉ": 418, "मो": 7849, "मौ": 11560, "मी": 10668, "मु": 25955, "मू": 2383, "मृ": 672, "मे": 11859, "लों": 8005, "शिं": 250, "कॉं": 84, "गैं": 44, "म्हों": 5, "ढ्ढा": 14, "खां": 3, "ख़्वा": 79, "खें": 952, "स्टैं": 31, "र्गें": 1, "र्नां": 118, "ड्डों": 138, "च्चों": 1533, "ट्री": 94, "ठ्टी": 3, "रूँ": 318, "रूं": 141, "ज्बा": 2, "ल्फ़": 16, "ऊ": 7494, "व्यं": 71, "थि": 2603, "था": 21323, "र्ज़": 584, "र्जि": 108, "र्जा": 965, "ल्य": 99, "व्या": 1894, "ट्टि": 96, "ट्टा": 266, "ष्मि": 41, "धं": 107, "ठों": 154, "बँ": 325, "को": 110576, "ट्टी": 791, "ट्टू": 38, "व्यू": 253, "ट्टे": 86, "च्च": 1474, "च्छ": 84, "र्जु": 389, "थै": 117, "थौ": 2, "थॉ": 56, "स्त्रि": 43, "थो": 840, "फ़्रां": 746, "कु": 24960, "थे": 10506, "फ़्राँ": 10, "थु": 118, "स्रो": 136, "थू": 37, "जां": 141, "पिं": 341, "ह्र": 13, "थ्य": 192, "थी": 10687, "रं": 15649, "रः": 13, "रँ": 5, "थ्र": 9, "स्त्रां": 14, "म्र": 2348, "ज़्ज़ा": 17, "टां": 14, "टाँ": 26, "रा": 115681, "रि": 28630, "म्स": 545, "कों": 6531, "म्त": 9, "त्रीः": 1, "व": 67908, "र्टू": 405, "फ्रें": 38, "थ्यों": 93, "म्म": 1852, "म्य": 7, "म्ब": 147, "म्भ": 27, "म्प": 139, "क्खां": 29, "म्न": 42, "प्ट": 406, "र्ब्स": 17, "रू": 13215, "री": 66985, "रु": 9796, "रे": 47622, "रो": 24589, "रै": 529, "रॉ": 627, "रौ": 83, "र्": 47, "प्स": 25, "धों": 681, "ड्य": 8, "प्ल": 8, "प्र": 35246, "प्श": 14, "प्प": 1145, "ड्स": 1165, "प्न": 15, "ड्र": 31, "प्त": 1617, "ज़ि": 6766, "ज़ा": 14603, "प्ति": 145, "प्ता": 1983, "श्मि": 3, "श्मा": 144, "तौ": 2083, "त्": 10, "तो": 20437, "तै": 3029, "फ़्टि": 62, "तू": 2217, "तृ": 1253, "ती": 37130, "तु": 4629, "त्रो": 2, "ज़ं": 20, "त्रु": 62, "त्री": 10044, "त्रि": 2643, "र्में": 170, "ठ्ठे": 1, "र्रा": 116, "ता": 97022, "ड़ीं": 66, "त़": 3, "नां": 80, "दो": 12870, "फ़्टी": 4, "र्ल्स": 385, "र्ज़ों": 2, "श्मे": 10, "तं": 5991, "तः": 160, "ज़ो": 1226, "ज़ै": 14, "तां": 322, "ज़ू": 858, "ज़ु": 360, "ज़ी": 4245, "ज़े": 302, "व्व": 45, "ब्रे": 70, "ब्रु": 9, "ब्री": 34, "ब्रू": 7, "ब्रॉ": 41, "ब्रै": 56, "क्वि": 13, "क्वा": 78, "स्टी": 668, "स्टु": 17, "स्टू": 109, "व्य": 5356, "लैं": 1473, "स्टै": 35, "स्टॉ": 113, "ट": 53208, "स्टो": 104, "षे": 100, "सैं": 96, "न्ज़िं": 21, "प्सी": 20, "नीः": 1, "नीं": 356, "ल्ज़ा": 20, "षो": 9, "ग्वि": 45, "ग्वा": 32, "ग्वे": 5, "र्ज़े": 4, "स्टं": 46, "षि": 1026, "षा": 6317, "ठ्ठा": 7, "कैं": 452, "क्ष्यों": 66, "स्टा": 551, "स्टि": 165, "क्वी": 39, "ख़ें": 14, "फ्फ़": 18, "ब्रि": 3580, "धै": 47, "ख़िं": 2, "ख": 20656, "ईं": 1695, "स्तों": 246, "म्ह": 4, "न्ड़ो": 1, "ड्रिं": 10, "भौ": 39, "ग्ट": 21, "ख़्त": 443, "त्यां": 10, "ग्ग": 65, "थ्रो": 46, "रों": 14452, "ख़्र": 10, "ख़्स": 20, "छों": 22, "वाँ": 762, "वां": 131, "ग्स": 253, "ग्र": 1504, "ग्न": 32, "ग्य": 470, "त्यों": 6, "ह्मां": 73, "ग्ध": 572, "क्ट्स": 2, "खूं": 51, "खूँ": 49, "फ्रा": 43, "फ्रि": 2, "ढां": 62, "ढाँ": 98, "ल्पा": 45, "छः": 7, "छँ": 10, "छि": 497, "छा": 12505, "गिं": 16, "म्पॉ": 19, "ब्दों": 328, "र्जों": 1, "फ्रं": 23, "न्मीं": 14, "टूं": 1, "ध्य": 1977, "म्पि": 670, "म्पा": 10, "ढें": 20, "छू": 581, "छु": 855, "छी": 186, "छे": 1684, "छो": 3474, "ध्र": 590, "ध्व": 77, "क्ष्य": 558, "क्ष्म": 221, "ख़्मी": 48, "स्कू": 1001, "न्तु": 15, "स्कृ": 673, "फ्री": 290, "फ्रू": 2, "फ्रे": 3, "श्दी": 8, "बें": 173, "र्पि": 46, "फ्त": 47, "र्फ़ी": 15, "क्यो": 34, "र्षों": 973, "क्रे": 481, "क्यू": 173, "क्यु": 33, "ये": 14899, "झूँ": 3, "झूं": 5, "क्री": 270, "ढों": 5, "क्या": 8513, "द़": 3, "शां": 2136, "शाँ": 8, "एः": 17, "एं": 12797, "एँ": 5766, "र्पू": 11, "र्पो": 57, "हें": 1693, "ह्ते": 3, "त्मे": 24, "र्शी": 35, "फ": 3010, "त्सा": 708, "पौ": 162, "पै": 3110, "पॉ": 1118, "र्सि": 755, "पो": 3806, "प्रे": 2140, "सीं": 107, "पे": 11457, "पी": 8552, "पु": 12153, "पू": 9505, "प्री": 1135, "प्रि": 881, "प्रा": 1410, "पा": 40414, "पि": 4825, "र्सी": 160, "ध्रु": 43, "र्से": 64, "त्सु": 112, "ष्टि": 1514, "र्शि": 19, "र्शा": 41, "र्ग़ा": 6, "त्मि": 67, "त्मा": 272, "श्रीं": 1, "कीं": 156, "कीः": 4, "पं": 2316, "पः": 28, "ग्रा": 999, "ग्रि": 17, "स्खा": 7, "र्वा": 55, "र्वि": 247, "स्फ़ो": 31, "फ़्रि": 2, "ख्ता": 39, "ब्या": 183, "न्ज़": 6, "ट्ठे": 56, "ट्ठी": 118, "ष्का": 369, "ग्रं": 17, "र्जें": 473, "ख्म": 8, "किं": 469, "ख्त": 36, "र्द्ध": 120, "ब्यो": 10, "ब्यौ": 99, "ख्स": 44, "नों": 12091, "ब्यू": 240, "फ़्रू": 4, "ख्र": 2, "फ़्री": 966, "र्वी": 546, "र्वे": 1093, "क्यों": 4528, "स्खे": 2, "र्वो": 488, "र्वौ": 1, "ग्रै": 45, "ग्रॉ": 195, "ग्रो": 34, "ग्रे": 5470, "ग्री": 633, "ग्रु": 375, "ग्रू": 2, "क्क": 496, "क्ख": 8, "न्ट्रो": 5, "क्ट": 4494, "न्ट्रै": 13, "क्च": 36, "स्ली": 48, "रौं": 11, "स्लो": 2, "र्ड्स": 124, "क्ष": 5475, "क्श": 295, "क्र": 12139, "चूँ": 145, "क्ल": 402, "र्भों": 11, "भ": 13542, "क्स": 7194, "क्त": 5615, "ल्डो": 97, "ल्क़": 7, "क्य": 79, "क्म": 21, "क्न": 2, "र्चों": 65, "श्रि": 37, "ढिं": 4, "छां": 15, "छाँ": 22, "चा": 52120, "प्लें": 6, "ल्मि": 4, "स्लि": 1130, "स्ला": 1100, "गां": 1796, "गाः": 9, "गाँ": 1767, "ह़": 2, "ते": 35660, "स्थों": 36, "ज्वे": 2, "न्में": 2, "क्वीं": 8, "मों": 1155, "ख्‍य": 4, "योः": 96, "यों": 17262, "शा": 15976, "शि": 15935, "शं": 1108, "शः": 10, "फ्तों": 27, "ब": 147568, "डों": 106, "न्नी": 50, "स्में": 42, "बीं": 27, "स्टां": 9, "पॉं": 9, "फ़ां": 2, "शी": 4349, "शु": 9169, "शू": 426, "शे": 4078, "शै": 382, "शॉ": 215, "शो": 2183, "शौ": 272, "श्": 343, "स्या": 1586, "झुँ": 2, "हीं": 37460, "झुं": 15, "न्द्र": 235, "भ्रं": 7, "र्ल्ड": 512, "त्रा": 3156, "र्धी": 10, "ग": 103927, "द्धां": 321, "बि": 11131, "ल्हों": 1, "न्ढूँ": 2, "न्हों": 9777, "ह्मा": 18, "र्ख़ी": 14, "र्ख़ि": 4780, "घों": 2, "श्ताः": 4, "क़्क": 11, "नाँ": 11, "ति": 32608, "र्धा": 298, "क़्त": 535, "न्फ़ो": 207, "य्या": 21, "सुं": 342, "भे": 12712, "ल्को": 8, "भु": 500, "भी": 43943, "थ्री": 51, "भू": 5518, "ल्की": 34, "ल्कु": 516, "भै": 58, "भो": 1184, "ल्के": 30, "स्फो": 993, "फ़िं": 7, "ग्या": 329, "स्को": 770, "स्कै": 39, "स्कॉ": 123, "र्दि": 48, "र्दा": 209, "स्की": 9, "स्कु": 75, "स्के": 49, "म": 208833, "ख्वा": 78, "सूँ": 5, "सूं": 6, "भँ": 22, "भं": 570, "र्दे": 1324, "स्का": 1674, "र्दू": 5061, "र्दु": 1, "र्दी": 130, "र्दो": 175, "प्लि": 7, "हों": 3409, "होँ": 3, "ड्डा": 68, "शें": 298, "ल्ड्रे": 9, "ल्का": 52, "ल्कि": 1126, "थ्रि": 13, "भि": 3969, "भा": 29228, "ट्रां": 28, "काँ": 838, "कां": 2782, "काः": 1, "प्लं": 13, "प्ले": 253, "श्मी": 2914, "प्लो": 3, "प्ली": 6, "द्यों": 22, "म्झा": 1, "प्लू": 42, "दी": 26436, "दु": 10108, "दू": 10053, "दृ": 632, "ष्पे": 17, "दे": 38734, "दै": 124, "दॉ": 18, "ड्डि": 22, "प्ला": 131, "दौ": 5569, "र्क": 2964, "र्ख": 47, "र्ग": 1258, "ड्डी": 190, "ड्डू": 33, "र्ज": 1946, "प्लॉ": 5, "र्ट": 3916, "र्घ": 634, "प्लै": 24, "र्च": 5146, "दि": 38941, "चां": 101, "चाँ": 514, "दा": 32699, "शों": 4603, "र्व": 1818, "र्श": 3831, "र्ष": 2672, "र्र": 686, "र्ल": 357, "र्ल्ट": 14, "र्स": 744, "र्न्स": 9, "र्त": 630, "र्थ": 4195, "र्द": 965, "र्ध": 111, "र्ड": 6863, "क़्शा": 13, "र्ण": 3302, "र्ब": 180, "र्भ": 709, "र्म": 3535, "र्य": 11932, "र्न": 754, "र्प": 172, "र्फ": 356, "भें": 70, "ज़्जु": 1, "ब्रें": 28, "घ": 10286, "ज्ञों": 12, "व्र": 130, "च्छु": 55, "पूं": 56, "पूँ": 52, "मैं": 7351, "फूं": 20, "फूँ": 29, "ज्ञ्या": 2, "सौ": 1932, "ज़्ज़": 61, "स्टे": 765, "त्त्व": 101, "चौ": 1545, "ट्रे": 857, "चै": 1752, "चॉ": 65, "र्नि": 153, "र्ना": 311, "ट्रौ": 4, "भैं": 32, "चे": 4572, "ट्रै": 75, "ट्रॉ": 302, "चू": 315, "ट्रो": 627, "ह्यू": 146, "जॉं": 1, "माः": 16, "मां": 1844, "माँ": 2451, "दं": 1325, "दः": 4, "स्मि": 131, "स्मा": 436, "ब़": 28, "स्मे": 10, "बे": 7593, "स्मृ": 73, "बृ": 24, "बी": 40128, "बु": 8284, "ष्ट्रों": 68, "बौ": 71, "स्मो": 2, "बो": 4635, "चं": 1944, "द्धे": 18, "ज़िं": 1048, "ल्फ़ें": 2, "झ्को": 5, "षी": 471, "र्नो": 58, "चि": 4718, "र्नी": 59, "ट्रा": 67, "फ़्तों": 74, "र्ने": 7, "र्थी": 251, "ब़ि": 6, "म्रा": 127, "च": 43477, "ड्रो": 14, "ड्रै": 2, "ड्रॉ": 117, "ड्री": 66, "ड्रे": 36, "र्मिं": 223, "न्द्रा": 10, "साँ": 379, "सां": 1141, "ड्रा": 288, "ड्रि": 38, "डूं": 36, "फ़ाँ": 7, "घ्न": 28, "र्था": 29, "र्थि": 189, "अ": 123986, "ग्लि": 96, "ड़ें": 278, "ढ्‌ढी": 1, "णि": 572, "णा": 4673, "थ्यू": 81, "क्शे": 87, "णः": 2, "ष्यों": 96, "र्यों": 265, "क्सा": 34, "क्सि": 142, "फों": 4, "र्डों": 34, "न्ज": 4, "न्झ": 1, "न्ट": 43, "फ़्लिं": 11, "न्च": 2, "ल्क": 220, "ल्च": 14, "क्से": 32, "न्ग": 18, "ल्ट": 211, "क्सी": 128, "क्शा": 48, "ओँ": 22, "ल्ल": 77, "थ्या": 7, "म्ज़": 33, "न्स": 245, "न्ह": 81, "क्शं": 15, "ल्व": 40, "णू": 19, "ल्स": 430, "ल्ह": 182, "णे": 127, "ल्म्स": 28, "ग्लो": 179, "न्म": 905, "न्य": 6109, "ल्द": 391, "ल्त": 7, "ल्थ": 51, "ल्प": 836, "ल्फ": 2, "न्द": 137, "न्ध": 31, "ल्म": 6772, "न्ड": 32, "ल्ब": 28, "स्त्रों": 11, "फ्लू": 347, "क्को": 11, "खीं": 344, "क्के": 191, "क्की": 148, "फ्लै": 34, "ढ़ं": 25, "त्रों": 1365, "ल्ड्र": 10, "श्‍व": 2, "ल्ड्स": 13, "ढ़ि": 2629, "ढ़ा": 2997, "ठें": 36, "ढ़ौ": 9, "र्बा": 127, "ढ़ो": 295, "ढ़े": 536, "ढ़ी": 1127, "ढ़ू": 1, "श्‍वा": 2, "द्ढ़": 2, "दों": 1378, "त्यें": 15, "क्क़": 23, "क्कि": 22, "क्का": 307, "ल्बो": 11, "क्वे": 29, "गों": 11686, "न्त": 13, "त्‍न": 1, "य": 109266, "स्क्रि": 51, "डॉं": 2, "फ़्फ": 25, "फ़्न": 15, "णें": 2, "ज्ञा": 1786, "स्क्री": 75, "फ़्त": 481, "बूँ": 26, "बूं": 28, "ल्शि": 4, "मिं": 99, "ब्रा": 1079, "फ़्ट": 302, "ज़ों": 574, "ब़्जा": 1, "द": 132286, "डें": 52, "नो": 13448, "नै": 404, "नॉ": 258, "नौ": 2933, "न्": 135, "नू": 3035, "नृ": 133, "नी": 52410, "नु": 7792, "ने": 177727, "ना": 95360, "नि": 50132, "ऩ": 10, "र्भा": 113, "र्बाँ": 4, "नं": 1691, "नः": 27, "म्सा": 7, "डौ": 2, "क्ट्री": 37, "ढ़ाँ": 20, "तूँ": 2, "न्हें": 5816, "क्ट्रॉ": 49, "ल्जि": 99, "ल्जा": 5, "ज़्नी": 54, "ईँ": 2, "म्प्ले": 10, "फ्टी": 6, "हूँ": 3987, "हूं": 467, "स्म": 309, "स्य": 1611, "स्न": 87, "स्प": 3100, "स्त": 5471, "स्थ": 746, "स्द": 1, "स्व": 2338, "स्र": 280, "स्ल": 55, "ल्जी": 21, "ह्सा": 1, "स्यों": 672, "न्ग्रे": 1, "क्ट्रा": 10, "क्ट्रि": 17, "तूं": 1, "स्ट": 7395, "स्कैं": 22, "खाँ": 63, "श्चिं": 10, "स्क": 269, "ल्बा": 9, "फ़ा": 4606, "फ़ि": 11939, "ऐ": 10212, "बं": 14688, "भ्रां": 20, "बः": 16, "स्ट्र": 10, "ट्रू": 8, "व्ही": 18, "चो": 1381, "व्हे": 9, "ठ्ठी": 6, "फ़ँ": 2, "फ़ं": 50, "स्ट्म": 2, "रें": 11668, "ची": 12915, "गुं": 64, "ठ्ठि": 1, "चु": 14699, "ट्रें": 17, "व्हा": 336, "फ़े": 1246, "फ़ी": 5111, "फ़ु": 795, "फ़ू": 30, "फ़ौ": 245, "फ़ै": 3720, "फ़ॉ": 333, "फ़ो": 1329, "यौ": 422, "यो": 18996, "तीं": 338, "यॉ": 780, "यै": 6, "प्रां": 522, "यू": 5231, "यु": 7791, "यी": 2072, "डाँ": 16, "डां": 39, "यां": 564, "याः": 9, "याँ": 3832, "न्नि": 63, "न्ना": 19823, "मुं": 3658, "मुँ": 230, "क्सिं": 27, "र्टिं": 24, "र्द्र": 7, "म्मे": 5988, "म्मी": 2552, "म्मू": 753, "फ्ट": 112, "र्खा": 8, "ल्सी": 84, "ल्सि": 7, "न्शा": 9, "र्खी": 27, "म्मि": 17, "म्मा": 922, "यः": 12, "यं": 3020, "दुः": 55, "ख़्म": 17, "धुं": 46, "धुँ": 47, "न्नु": 5, "ल्दी": 596, "ढ़ूं": 9, "न्नू": 24, "स्था": 7406, "स्थि": 2765, "न्ने": 278, "यि": 305, "या": 112156, "य़": 8, "च्यू": 2, "श्ती": 29, "न्वि": 7, "स्ति": 1533, "स्ता": 11789, "स्तं": 63, "बों": 518, "द्धा": 208, "द्धि": 434, "म्प्यू": 26, "म्प्यु": 1, "द्धू": 17, "द्धी": 1, "ल्फ़ि": 210, "ल्फ़ा": 117, "बा": 68358, "ग्रैं": 68, "स्ते": 2098, "स्तु": 393, "स्ती": 2635, "स्तृ": 136, "स्तौ": 19, "स्तै": 8, "स्तो": 3, "श्ति": 7, "श्ता": 236, "राँ": 168, "रां": 199, "जूं": 3, "ज्ज": 49, "ज्ञ": 339, "बू": 3124, "ज्य": 3506, "ल्टे": 20, "ल्टी": 117, "ज्व": 8, "चँ": 4, "ल्टा": 133, "बै": 4577, "बॉ": 2128, "क्ष्मी": 263, "न्फ़्रें": 33, "र्बे": 5, "र्बी": 122, "श्तै": 33, "श्ते": 605, "हुँ": 4050, "हुं": 401, "वैं": 8, "ष्णु": 41, "श्रृं": 20, "ष्णो": 3, "स्चि": 13, "ह़ु": 1, "ध्या": 560, "ल्पि": 15, "न्ता": 8, "इं": 13470, "ध्ये": 6, "श्क़ि": 6, "ष्णा": 124, "र्की": 573, "र्के": 64, "रैं": 167, "गीं": 141, "ढे": 170, "ढी": 72, "ढु": 19, "ध": 17761, "न्धे": 3, "न्धी": 1, "भ्र": 819, "ढो": 118, "भ्य": 149, "तुं": 16, "र्सों": 9, "ढ़": 5444, "ढा": 463, "ढि": 29, "ट्रि": 102, "ठूँ": 12, "ढँ": 5, "ढं": 261, "ठूं": 9, "र्तों": 77, "हिं": 12131, "र्क़": 112, "घो": 3130, "घू": 377, "घृ": 39, "घी": 11, "घु": 569, "घे": 218, "न्दि": 9, "न्दा": 27, "द्दे": 1394, "द्दी": 232, "ब्जे": 4, "र्खों": 2, "ड़ा": 8865, "ड़ि": 2039, "में": 9301, "ग्लें": 6, "स्वा": 2202, "स्वि": 191, "थें": 142, "ग्रें": 2, "हाँ": 9070, "हां": 1858, "ल्टें": 1, "स्वै": 12, "घं": 996, "स्वी": 3490, "स्वे": 13, "र्डिं": 90, "ड़ौ": 16, "ड़ो": 21969, "ड़े": 5596, "ज्वा": 136, "ड़ू": 16, "दें": 1606, "ड़ु": 4, "न्दो": 12, "ग़ों": 10, "न्दे": 3, "पें": 10031, "द्दा": 544, "ढ़ीं": 25, "न्दू": 26, "न्दु": 46, "न्दी": 3682, "व्वा": 6, "घा": 2203, "घि": 188, "ब़ा": 2, "फू": 616, "फु": 274, "फी": 443, "फे": 356, "ज़्ज": 5, "फो": 225, "फॉ": 168, "फै": 1293, "फौ": 85, "श्वा": 1002, "श्वि": 48, "त्का": 642, "फ़्यू": 29, "द्रि": 180, "द्रा": 308, "ष्टां": 2, "र्फी": 2, "र्फ़्यू": 308, "र्फ़्यु": 1, "फं": 140, "फँ": 123, "फ़्तो": 1, "रिं": 428, "ध्द": 3, "ड्र्यू": 37, "द्री": 143, "द्रे": 30, "त्कृ": 29, "द्रो": 1879, "श्वे": 12, "ज्यां": 23, "त्नों": 2, "फि": 6926, "फा": 384, "फ़": 17816, "छें": 24, "न्टी": 15, "क़ैं": 6, "स्टें": 2, "उँ": 68, "श्च": 200, "स्ताँ": 14, "स्तां": 52, "श्क": 90, "फैं": 2, "श्म": 239, "श्य": 856, "छै": 17, "त्नी": 540, "श्न": 320, "न": 261315, "श्त": 109, "खिं": 88, "र्को": 6, "क्सों": 3, "श्व": 1706, "श्ल": 1, "श्र": 662, "वें": 844, "स्पां": 8, "त्नि": 29, "त्ना": 14, "शृं": 17, "र्थ्य": 9, "र्नें": 8, "कूँ": 33, "कूं": 9, "लीं": 176, "ब्सि": 57, "टः": 18, "टं": 14, "टँ": 7, "टि": 3005, "टा": 5669, "फ्रॉ": 10, "स्सों": 339, "ज्यों": 695, "र्ल्ड्स": 7, "त्ज़ा": 41, "झाँ": 82, "झां": 33, "फां": 5, "फाँ": 50, "र्कें": 5, "रॉं": 6, "टौ": 1498, "टो": 1382, "टॉ": 666, "टै": 254, "टे": 11348, "चेँ": 1, "चें": 270, "टू": 663, "टु": 150, "टी": 7689, "भौं": 10, "ढू": 5, "न्‍या": 4, "ष्क्रि": 14, "श्च्चि": 1, "द्गा": 1, "र्जी": 569, "गूं": 63, "गूँ": 88, "ग़ै": 610, "विं": 383, "ग़ौ": 547, "भों": 16, "ग़ी": 50, "ग़ु": 289, "ल्फी": 2, "प": 261750, "ग़े": 20, "टूँ": 12, "त्र्य": 2, "स्थ्य": 1139, "ल्फि": 11, "ग़ा": 3930, "ग़ि": 22, "ख़्या": 121, "ग़ं": 10, "त्त": 4891, "त्थ": 210, "त्न": 36, "त्प": 138, "त्म": 2519, "त्य": 1040, "त्र": 18601, "त्ल": 27, "क": 277604, "त्व": 3438, "त्स": 560, "त्क": 7, "क्खि": 3, "क्खी": 4, "ल्‍दी": 2, "फ्रैं": 7, "क्राँ": 82, "क्रां": 330, "न्धु": 3, "ढ़ूँ": 16, "फ्रां": 467, "फ्राँ": 6, "ख्सि": 12, "औ": 105112, "ग्बी": 31, "ग्ला": 547, "प्यू": 645, "प्यु": 1, "ख़ै": 45, "ख़ो": 9, "ख़ौ": 74, "ख़ु": 2455, "ख़ी": 23, "न्टिं": 14, "ख़ू": 640, "थ्वी": 384, "ख़े": 5, "क़ों": 964, "हीँ": 23, "ख़ि": 6141, "ख़ा": 5984, "र्द्धा": 16, "स्प्रिं": 7, "प्या": 2168, "ल्में": 929, "क्मे": 4, "न्ति": 10, "नें": 1055, "ड्ढा": 60, "ड़ों": 1014, "र्फ्यू": 21, "ल्ट्री": 56, "षों": 369, "र्षा": 21, "र्षि": 108, "त्या": 667, "त्यि": 73, "त्यं": 81, "शीं": 17, "फ़्ला": 54, "कुँ": 20, "कुं": 339, "लुं": 2, "लुँ": 2, "ख़ां": 4, "क्तों": 17, "फ़्लू": 942, "फ़्ले": 31, "फ़्लॉ": 24, "फ़्लै": 13, "फ़्लो": 50, "त्यु": 189, "र्षी": 487, "त्ये": 62, "त्यो": 85, "त्यौ": 114, "र्षो": 21, "ल्ट्रा": 38, "ड्ढे": 10, "ज़ुँ": 1, "घुँ": 5, "फ्लिं": 8, "कें": 3096, "स्वं": 22, "लें": 6989, "श": 47984, "ष्यं": 11, "त्थे": 14, "त्थी": 20, "र्छा": 1, "दां": 64, "दाँ": 126, "ब्जी": 3, "क़्क़्तें": 2, "ष्या": 11, "क्कों": 24, "स्टिं": 19, "म्हें": 172, "ल्ग": 8, "ड": 20452, "क्टिं": 19, "न्क": 2, "र्णो": 16, "ख़्बा": 1, "द्रों": 138, "ल्यों": 77, "मूं": 21, "मूँ": 37, "त्तों": 48, "यीं": 7, "झों": 68, "प्पें": 4, "ठ": 8400, "र्डी": 11, "र्व्य": 352, "र्डो": 7, "जीं": 33, "णो": 2, "फ़्रें": 46, "फ़ें": 21, "र्डि": 85, "घुं": 35, "स्पें": 9, "फ़्ज़": 2, "णु": 198, "निः": 1, "णी": 3258, "ऋ": 160, "सें": 1276, "निं": 764, "टुं": 2, "ज़्बे": 30, "क्लै": 8, "क्लॉ": 3, "क्लो": 165, "क्ली": 51, "क्लू": 8, "क्ता": 152, "क्ति": 3258, "क्ले": 16, "छीं": 1, "ल्ड": 483, "तिं": 9, "न्न": 1325, "क्तू": 3302, "ष्प": 12, "क्ती": 3, "ष्य": 958, "ष्म": 32, "क्ला": 373, "क्लि": 861, "ष्ण": 928, "ष्ठ": 789, "लॉं": 11, "ग्ली": 1, "ज़्बा": 11, "ष्ट": 1644, "ष्क": 79, "ग्ले": 62, "त्ती": 628, "त्तू": 7, "त्ते": 99, "ठी": 3032, "ठु": 366, "ठे": 948, "र्मों": 83, "प्नि": 23, "ठो": 282, "नूँ": 35, "ठौ": 66, "ह्वा": 18, "ड़ी": 13738, "प्रो": 813, "वों": 1659, "श्चि": 2040, "श्चा": 19, "प्रॉ": 1, "प्रै": 4223, "फ्लो": 10, "ठा": 3367, "ठि": 738, "ठं": 182, "ठँ": 1, "भिं": 4, "त्ति": 1069, "त्ता": 2576, "टैं": 106, "पृ": 512, "ख्या": 2714, "क्टो": 32, "ब्जि": 1, "स्टों": 24, "स्व्छ": 2, "क्टे": 11, "ब्जा": 10, "र्चि": 244, "र्चा": 1462, "क्टी": 45, "र्चः": 1, "र्ज़ा": 282, "र्ज़ि": 10, "ष्ठा": 18, "ष्ठि": 193, "म्का": 5, "गें": 1581, "म्हीं": 32, "ष्ठी": 8, "ष्ठु": 2, "चों": 765, "द्म": 19, "द्य": 259, "र्ज़ी": 63, "द्भ": 2, "भीं": 15, "ख़ों": 27, "द्द": 371, "द्ध": 2018, "त": 145651, "क्टि": 16, "र्चु": 65, "र्ची": 33, "र्चे": 191, "ल्डिं": 22, "र्चो": 2, "द्ग": 1, "ठ्य": 61, "ख़्शी": 12, "न्हा": 278, "क़्ति": 1, "दूं": 134, "दूँ": 146, "द्वे": 14, "द्वी": 299, "ढ़ें": 115, "ड्डे": 313, "स्नि": 7, "स्ना": 19, "म्प्ड": 1, "फ़ैं": 11, "औं": 14, "स्ख़ा": 18, "र्ट्स": 39, "स्ख़े": 14, "स्ने": 25, "द्वं": 8, "डूँ": 4, "द्वा": 858, "द्वि": 282, "र्सिं": 278, "स्मां": 1, "न्हे": 131, "स्माँ": 3, "न्ही": 49, "न्हो": 139, "न्है": 12, "तें": 1960, "धि": 12311, "धा": 14015, "न्कॉ": 15, "न्की": 1, "घूँ": 39, "ष्ट्र": 9090, "घूं": 7, "श्मों": 2, "श्नः": 8, "कौ": 11125, "कॉ": 5084, "कै": 4342, "ष": 14352, "वू": 16, "के": 211810, "जाँ": 1965, "की": 148106, "कृ": 2258, "कू": 426, "क़": 12454, "कि": 96957, "का": 170970, "न्हीं": 427, "टीं": 20, "ड़ूँ": 10, "ड़ूं": 5, "ह्म": 68, "श्नो": 5, "ल्लों": 7, "न्का": 20, "न्क़": 17, "पँ": 8, "धे": 1648, "धू": 702, "धु": 1054, "धी": 4663, "धो": 624, "कं": 6409, "जिं": 572, "टों": 1764, "ल्क़ों": 7, "ष्टी": 100, "क्रू": 234, "र्ग़े": 19, "क्रु": 7, "छूं": 4, "ब्ब": 505, "छूँ": 24, "क्रो": 183, "क्रै": 23, "क्रॉ": 41, "स्बों": 18, "ट्र": 272, "ह्ती": 1, "क्रा": 37, "क्रि": 5361, "ट्स": 276, "र्ग़ि": 60, "ष्टा": 570, "ट्य": 113, "ल्मों": 1782, "सों": 1023, "ग्नि": 32, "ट्ट": 370, "श्क़": 22, "श्कि": 1614, "त्वा": 38, "त्वि": 51, "ड्डो": 12, "स्‍ती": 2, "सा": 56599, "सि": 16269, "स़": 2, "फ़्तु": 7, "यूँ": 229, "फ़्ते": 322, "क्ट्ठा": 2, "स्जि": 469, "सं": 33860, "भाँ": 53, "भां": 143, "सँ": 124, "फ़्रं": 60, "ल्बी": 8, "ह": 203524, "ब्रां": 42, "ट्ज़िं": 8, "प्स्टि": 1, "फ़्रा": 16, "ब्वे": 198, "ख्मी": 3, "फ्ला": 8, "ढ": 385, "द़ि": 2, "ग्लै": 40, "खों": 1387, "सो": 7103, "सै": 6176, "सॉ": 394, "फ़्ति": 16, "फ़्ता": 1269, "र्गों": 182, "स्": 2, "सू": 7103, "सी": 40524, "सु": 20256, "से": 120983, "उं": 859, "क्ठ्ठा": 3, "ष्ट्रः": 6, "नूं": 112, "ड़": 13488, "डि": 9795, "डा": 4103, "डः": 16, "डं": 27, "म्बो": 9, "ल्ता": 161, "म्बे": 126, "थों": 554, "म्बु": 10, "म्बी": 20, "न्सी": 6, "न्जा": 43, "न्से": 17, "धँ": 2, "स": 287735, "स्मों": 48, "ज़ें": 213, "क्षों": 264, "र्वाँ": 1, "न्सि": 11, "न्सा": 36, "म्बि": 2, "म्बा": 211, "ब्ल्यू": 35, "धें": 3, "पों": 784, "डु": 579, "डी": 4215, "डू": 945, "बैं": 1005, "डे": 3934, "डॉ": 5920, "डै": 70, "डो": 1322, "कँ": 7, "ह्त्त्व": 1, "ह्ता": 1, "लां": 971, "लाँ": 34, "ष्कृ": 2, "ख्य": 2834, "ग्लू": 1, "ज़ॉं": 6, "ण": 23418, "र्यो": 19, "फ्टों": 2, "श्नों": 19, "य्य": 82, "फ्ता": 80, "जूँ": 5, "फ्ते": 76, "फ्ती": 3, "र्या": 2028, "श्तों": 233, "र्ब़ा": 2, "क़्क़ी": 8, "स्याः": 13, "झें": 57, "र्मि": 1028, "र्मा": 2742, "न्टे": 1, "लँ": 2, "लं": 6387, "लः": 11, "ल़": 4, "र्क्स": 244, "ला": 78226, "लि": 47678, "र्मः": 4, "र्मं": 1, "ऐं": 121, "ब्दु": 578, "ब्दी": 327, "मँ": 22, "ख्ती": 8, "म्हा": 254, "म्ही": 8, "म्हे": 48, "ब्दि": 122, "ब्दा": 21, "ले": 48628, "ली": 39412, "लु": 498, "लू": 2385, "लौ": 1774, "ल्": 92, "क्स्ट": 10, "लै": 163, "लॉ": 568, "लो": 22238, "र्मो": 8, "र्मे": 20, "ग्वां": 97, "र्मू": 98, "र्मी": 749, "फ़्रैं": 33, "त्पू": 4, "स्क्रै": 22, "प्पि": 7, "प्पा": 42, "थ": 14677, "स्कों": 25, "ड्यू": 95, "सौं": 815, "क्यूँ": 48, "गो": 13302, "ड्या": 14, "प्पे": 12, "अं": 7618, "प्पी": 93, "प्पू": 107, "र्कों": 13, "त्पा": 412, "ड्यं": 33, "ज्जों": 6, "लूं": 121, "लूँ": 143, "स्सी": 122, "र्गे": 27, "र्गी": 132, "स्से": 603, "र्गो": 1, "चैं": 303, "र्तें": 67, "प्सि": 1, "हॉ": 1155, "है": 132718, "हो": 48881, "हौ": 1410, "हु": 32920, "ही": 38009, "हृ": 94, "हू": 939, "क़्शे": 18, "हे": 17194, "थिं": 2, "र्ष्या": 23, "ख़्त्म": 1, "भूं": 16, "प्रिं": 80, "डिं": 61, "हि": 35108, "हा": 64870, "मीं": 69, "ठीं": 26, "ग्लैं": 958, "हँ": 470, "श्‌म": 1, "हः": 34, "हं": 753, "यूं": 160, "न्फ्रें": 22, "र्लिं": 15, "र्गा": 97, "र्गि": 151, "स्सि": 1, "स्सा": 1685, "ल्हा": 40, "गं": 1658, "गँ": 113, "ए": 167190, "दीं": 82, "ट्‌टी": 1, "पैं": 90, "बॉं": 3, "क्टू": 62, "गि": 6542, "गा": 33913, "लिं": 3757, "ग़": 4020, "गे": 12960, "गृ": 136, "गू": 1053, "गु": 9677, "गी": 15636, "द्दों": 444, "ग्": 5, "गौ": 324, "अँ": 144, "गॉ": 95, "गै": 1512, "चूं": 91, "म्यू": 163, "म्यु": 650, "ल्हो": 55, "ल्हे": 35, "र्शों": 18},

		'AA_matra': 'ा',
		"groups" : [
            [
                "\u0905", // DEVANAGARI LETTER A
                "\u0906" // DEVANAGARI LETTER AA
            ], 
            [
                "\u0907", // DEVANAGARI LETTER I
                "\u0908" // DEVANAGARI LETTER II
            ], 
            [
                "\u0909", // DEVANAGARI LETTER U
                "\u090a" // DEVANAGARI LETTER UU
            ], 
            [
                "\u090b" // DEVANAGARI LETTER VOCALIC R
            ], 
            [
                "\u090f" // DEVANAGARI LETTER E
            ], 
            [
                "\u0910" // DEVANAGARI LETTER AI
            ],
            [
                "\u0913" // DEVANAGARI LETTER O
            ], 
            [
                "\u0914" // DEVANAGARI LETTER AU
            ], 
            [
                "\u0915", // DEVANAGARI LETTER KA
                "\u0916" // DEVANAGARI LETTER KHA
            ], 
            [
                "\u0917", // DEVANAGARI LETTER GA
                "\u0918" // DEVANAGARI LETTER GHA
            ], 
            [
                "\u0919", // DEVANAGARI LETTER NGA
            ],
            [
                "\u091a", // DEVANAGARI LETTER CA
                "\u091b" // DEVANAGARI LETTER CHA
            ], 
            [
                "\u091c", // DEVANAGARI LETTER JA
                "\u091d" // DEVANAGARI LETTER JHA
            ],
            [
                "\u091e" // DEVANAGARI LETTER NYA
            ],
            [
                "\u091f", // DEVANAGARI LETTER TTA
                "\u0920", // DEVANAGARI LETTER TTHA
                "\u0925", // DEVANAGARI LETTER THA
                "\u0924" // DEVANAGARI LETTER TA
            ], 
            [
                "\u0921", // DEVANAGARI LETTER DDA
                "\u0922", // DEVANAGARI LETTER DDHA
                "\u0926", // DEVANAGARI LETTER DA
                "\u0927" // DEVANAGARI LETTER DHA
            ], 
            [
                "\u0923", // DEVANAGARI LETTER NNA
                "\u0928" // DEVANAGARI LETTER NA
            ], 
            [
                "\u092a", // DEVANAGARI LETTER PA
                "\u092b" // DEVANAGARI LETTER PHA
            ], 
            [
                "\u092c", // DEVANAGARI LETTER BA
                "\u092d" // DEVANAGARI LETTER BHA
            ], 
            [
                "\u092e", // DEVANAGARI LETTER MA
            ], 
            [
                "\u092f", // DEVANAGARI LETTER YA
            ], 
            [
                "\u0930", // DEVANAGARI LETTER RA
            ], 
            [
                "\u0933", // DEVANAGARI LETTER LLA
                "\u0932" // DEVANAGARI LETTER LA
            ], 
            [
                "\u0935" // DEVANAGARI LETTER VA
            ], 
            [
                "\u0936", // DEVANAGARI LETTER SHA
                "\u0937", // DEVANAGARI LETTER SSA
                "\u0938" // DEVANAGARI LETTER SA
            ], 
            [
                "\u0939" // DEVANAGARI LETTER HA
            ],
            [
                "\u0901", // DEVANAGARI SIGN CANDRABINDU
                "\u0902" // DEVANAGARI SIGN ANUSVARA
            ], 
            [
                "\u0903" // DEVANAGARI SIGN VISARGA
            ], 
            [
                "\u093e", // DEVANAGARI VOWEL SIGN AA
                ""
            ],
            [
                "\u093f", // DEVANAGARI VOWEL SIGN I
                "\u0940" // DEVANAGARI VOWEL SIGN II
            ], 
            [
                "\u0941", // DEVANAGARI VOWEL SIGN U
                "\u0942" // DEVANAGARI VOWEL SIGN UU
            ], 
            [
                "\u0943" // DEVANAGARI VOWEL SIGN VOCALIC R
            ], 
            [
                "\u0945" // DEVANAGARI VOWEL SIGN CANDRA E
            ], 
            [
                "\u0948" // DEVANAGARI VOWEL SIGN AI
            ],
            [
                "\u0949", // DEVANAGARI VOWEL SIGN CANDRA O
                "\u094b" // DEVANAGARI VOWEL SIGN O
            ], 
            [
                "\u094c" // DEVANAGARI VOWEL SIGN AU
            ],
            /*
            [
                "\u094d", // DEVANAGARI SIGN VIRAMA
                "\u200d", // ZERO WIDTH JOINER
                "\u200c", // ZERO WIDTH NON-JOINER
                "\u093c" // DEVANAGARI SIGN NUKTA
            ], 
            */
            [
                "\u0947" // DEVANAGARI VOWEL SIGN E
            ], 
            [
                "\u0966" // DEVANAGARI DIGIT ZERO
            ], 
            [
                "\u0967" // DEVANAGARI DIGIT ONE
            ], 
            [
                "\u0968" // DEVANAGARI DIGIT TWO
            ], 
            [
                "\u0969" // DEVANAGARI DIGIT THREE
            ], 
            [
                "\u096a" // DEVANAGARI DIGIT FOUR
            ], 
            [
                "\u096b" // DEVANAGARI DIGIT FIVE
            ], 
            [
                "\u096c" // DEVANAGARI DIGIT SIX
            ], 
            [
                "\u096d" // DEVANAGARI DIGIT SEVEN
            ], 
            [
                "\u096e" // DEVANAGARI DIGIT EIGHT
            ], 
            [
                "\u096f" // DEVANAGARI DIGIT NINE
            ], 
            [
                "\u0950" // DEVANAGARI OM
            ]
        ]
    };
